; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-73)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc12)
    (at car1 loc8)
    (at car2 loc12)
    (at car3 loc12)
    (at car4 loc12)
    (at car5 loc4)
    (at car6 loc12)
    (at car7 loc2)
    (at car8 loc10)
    (at car9 loc12)
    (at car10 loc2)
    (at car11 loc11)
    (at car12 loc7)
    (at car13 loc8)
    (at car14 loc6)
)
 (:goal (and 
(at car1 loc12)
(at car2 loc2)
(at car3 loc8)
(at car4 loc2)
(at car5 loc3)
(at car6 loc4)
(at car7 loc11)
(at car8 loc1)
(at car9 loc1)
(at car10 loc5)
(at car11 loc2)
))
)

; plan
1. (board car3 loc12)
   deleted: (at car3 loc12) (empty-ferry)
   added: (on car3)
   goals met: 0 of 11
2. (sail loc12 loc8)
   deleted: (at-ferry loc12)
   added: (at-ferry loc8)
   goals met: 0 of 11
3. (debark car3 loc8)
   deleted: (on car3)
   added: (at car3 loc8) (empty-ferry)
   goals met: 1 of 11
4. (board car1 loc8)
   deleted: (at car1 loc8) (empty-ferry)
   added: (on car1)
   goals met: 1 of 11
5. (sail loc8 loc12)
   deleted: (at-ferry loc8)
   added: (at-ferry loc12)
   goals met: 1 of 11
6. (debark car1 loc12)
   deleted: (on car1)
   added: (at car1 loc12) (empty-ferry)
   goals met: 2 of 11
7. (board car6 loc12)
   deleted: (at car6 loc12) (empty-ferry)
   added: (on car6)
   goals met: 2 of 11
8. (sail loc12 loc4)
   deleted: (at-ferry loc12)
   added: (at-ferry loc4)
   goals met: 2 of 11
9. (debark car6 loc4)
   deleted: (on car6)
   added: (at car6 loc4) (empty-ferry)
   goals met: 3 of 11
10. (board car5 loc4)
   deleted: (at car5 loc4) (empty-ferry)
   added: (on car5)
   goals met: 3 of 11
11. (sail loc4 loc3)
   deleted: (at-ferry loc4)
   added: (at-ferry loc3)
   goals met: 3 of 11
12. (debark car5 loc3)
   deleted: (on car5)
   added: (at car5 loc3) (empty-ferry)
   goals met: 4 of 11
13. (sail loc3 loc12)
   deleted: (at-ferry loc3)
   added: (at-ferry loc12)
   goals met: 4 of 11
14. (board car2 loc12)
   deleted: (at car2 loc12) (empty-ferry)
   added: (on car2)
   goals met: 4 of 11
15. (sail loc12 loc2)
   deleted: (at-ferry loc12)
   added: (at-ferry loc2)
   goals met: 4 of 11
16. (debark car2 loc2)
   deleted: (on car2)
   added: (at car2 loc2) (empty-ferry)
   goals met: 5 of 11
17. (board car10 loc2)
   deleted: (at car10 loc2) (empty-ferry)
   added: (on car10)
   goals met: 5 of 11
18. (sail loc2 loc5)
   deleted: (at-ferry loc2)
   added: (at-ferry loc5)
   goals met: 5 of 11
19. (debark car10 loc5)
   deleted: (on car10)
   added: (at car10 loc5) (empty-ferry)
   goals met: 6 of 11
20. (sail loc5 loc12)
   deleted: (at-ferry loc5)
   added: (at-ferry loc12)
   goals met: 6 of 11
21. (board car4 loc12)
   deleted: (at car4 loc12) (empty-ferry)
   added: (on car4)
   goals met: 6 of 11
22. (sail loc12 loc2)
   deleted: (at-ferry loc12)
   added: (at-ferry loc2)
   goals met: 6 of 11
23. (debark car4 loc2)
   deleted: (on car4)
   added: (at car4 loc2) (empty-ferry)
   goals met: 7 of 11
24. (board car7 loc2)
   deleted: (at car7 loc2) (empty-ferry)
   added: (on car7)
   goals met: 7 of 11
25. (sail loc2 loc11)
   deleted: (at-ferry loc2)
   added: (at-ferry loc11)
   goals met: 7 of 11
26. (debark car7 loc11)
   deleted: (on car7)
   added: (at car7 loc11) (empty-ferry)
   goals met: 8 of 11
27. (board car11 loc11)
   deleted: (at car11 loc11) (empty-ferry)
   added: (on car11)
   goals met: 8 of 11
28. (sail loc11 loc2)
   deleted: (at-ferry loc11)
   added: (at-ferry loc2)
   goals met: 8 of 11
29. (debark car11 loc2)
   deleted: (on car11)
   added: (at car11 loc2) (empty-ferry)
   goals met: 9 of 11
30. (sail loc2 loc10)
   deleted: (at-ferry loc2)
   added: (at-ferry loc10)
   goals met: 9 of 11
31. (board car8 loc10)
   deleted: (at car8 loc10) (empty-ferry)
   added: (on car8)
   goals met: 9 of 11
32. (sail loc10 loc1)
   deleted: (at-ferry loc10)
   added: (at-ferry loc1)
   goals met: 9 of 11
33. (debark car8 loc1)
   deleted: (on car8)
   added: (at car8 loc1) (empty-ferry)
   goals met: 10 of 11
34. (sail loc1 loc12)
   deleted: (at-ferry loc1)
   added: (at-ferry loc12)
   goals met: 10 of 11
35. (board car9 loc12)
   deleted: (at car9 loc12) (empty-ferry)
   added: (on car9)
   goals met: 10 of 11
36. (sail loc12 loc1)
   deleted: (at-ferry loc12)
   added: (at-ferry loc1)
   goals met: 10 of 11
37. (debark car9 loc1)
   deleted: (on car9)
   added: (at car9 loc1) (empty-ferry)
   goals met: 11 of 11
